Show / Hide Table of Contents
Class SteelSetupAISC
Steel setup IBC class
Inheritance
System.Object
SteelSetup
SteelSetupAISC
Inherited Members
 SteelSetup.FrictionCoefficientPboltDefault()
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
public class SteelSetupAISC : SteelSetup
Properties
Improve this Doc   View Source
BoltBearing_Omega
Safety factor BoltBearing_Omega
Declaration
public double BoltBearing_Omega { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
BoltBearing_Phi
Safety factor BoltBearing_Phi
Declaration
public double BoltBearing_Phi { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
BoltSlipRes_Omega
Safety factor BoltSlipRes_Phi
Declaration
public double BoltSlipRes_Omega { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
BoltSlipRes_Phi
Safety factor BoltSlipRes_Phi
Declaration
public double BoltSlipRes_Phi { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
BoltTensileShear_Omega
Safety factor BoltTensileShear_Omega
Declaration
public double BoltTensileShear_Omega { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
BoltTensileShear_Phi
Safety factor BoltTensileShear_Phi
Declaration
public double BoltTensileShear_Phi { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
BoltTensileShearCombined_Omega
Safety factor BoltTensileShearCombined_Omega
Declaration
public double BoltTensileShearCombined_Omega { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
BoltTensileShearCombined_Phi
Safety factor BoltTensileShearCombined_Phi
Declaration
public double BoltTensileShearCombined_Phi { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
FilletWelds_Omega
Safety factor FilletWelds_Omega
Declaration
public double FilletWelds_Omega { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
FilletWelds_Phi
Safety factor FilletWelds_Phi
Declaration
public double FilletWelds_Phi { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MaterialFy_Omega
Safety factor MaterialFy_Omega
Declaration
public double MaterialFy_Omega { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MaterialFy_Phi
Safety factor MaterialFy_Phi
Declaration
public double MaterialFy_Phi { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ReductionFactorShear
ACI 318
Declaration
public double ReductionFactorShear { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ReductionFactorTension
ACI 318
Declaration
public double ReductionFactorTension { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source